N = int(input())

# 13 -> 8 -> 3(X)
# 13 -> 8 -> 6 -> 4-> 2> 0

# 100 ->95
# 3(X)

# 1 @불가
# 2 @1개
# 3 @불가
# 4 @2개
# 5 @ 1개
# 6 -> 1(X), @3개
# 7 -> 2-> 0 (O) @2개
# 8 -> 3(X), 8-> 6->4->2-> 0(O)@4개
# 9 -> 4 -> 2-> 0(O) @3개
# 10 -> 5-> 0 (O) @2개

["X", -1, 1, -1, 2, 1, 3, 2, 4, 3, 2]
# (id-5) +1 or (id -2) +1
# 5의 배수도 2의 배수도 아니면 실패?
dp = [0] * max(4, N + 1)
dp[1] = -1
dp[2] = 1
dp[3] = -1


if N <= 3:
    print(dp[N])
    exit(0)
for i in range(4, N + 1):
    if i % 5 == 0:
        if dp[i - 5] == -1:
            pass
        else:
            dp[i] = dp[i - 5] + 1
    elif i % 2 == 0:
        if dp[i - 2] == -1:
            pass
        dp[i] = dp[i - 2] + 1
    else:
        if dp[i - 5] == -1 or dp[i - 2] == -1:
            pass
        dp[i] = min(dp[i - 2], dp[i - 5]) + 1

print(dp[-1])
